# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [93]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [6]:
a = pd.Series([100,200,300,400], index = ['a','b','c','d'])

Print a, and data type

In [7]:
print(a)

a    100
b    200
c    300
d    400
dtype: int64

Using indexing access the element 300 from the series a.

In [8]:
print(a['c'])

300

What are the values of index for series a?

In [9]:
index = a.index
values = a.values

print (index)
print (values)

Index(['a', 'b', 'c', 'd'], dtype='object')
[100 200 300 400]

Change the index to  ['c', 'a', 'b', 'd']

In [10]:
s = a.reindex(index = ['c','a','b','d'])

s.head()

c    300
a    100
b    200
d    400
dtype: int64

Access the value in the series with index 'd'

In [11]:
print (a['d'])

400

Sort the values wrt to the index and print it

In [12]:
a.sort_index(axis = 0)

a    100
b    200
c    300
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [12]:
numbers = [800 ,450 ,100]
ser1 = pd.Series(list(numbers))
index = ["e","f","g"]
ser = pd.Series((index))

print (ser1)
print (ser)

0    800
1    450
2    100
dtype: int64
0    e
1    f
2    g
dtype: object

Append b series at the end of a series

In [8]:
 a = ser._append(ser1)

In [9]:
#print a again after appending b into it
print (a)

0      e
1      f
2      g
0    800
1    450
2    100
dtype: object

Sort the values in descending order of a and print the index of the sorted series

In [13]:
 a = a.sort_index(axis = 0)

print (a)

0      e
0    800
1      f
1    450
2      g
2    100
dtype: object

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [17]:
df = pd.DataFrame ([100,200,300,400,500,600])

In [18]:
df.head()

     0
0  100
1  200
2  300
3  400
4  500

What is the shape of the datafarme <br>
(also, what does it imply?)

In [19]:
df.shape

(6, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [20]:
# yep its same as the series.

index = df.index
print (index)

RangeIndex(start=0, stop=6, step=1)

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [21]:

df

     0
0  100
1  200
2  300
3  400
4  500
5  600

In [22]:
print (df.head(2))


print (df.tail(2))

     0
0  100
1  200
     0
4  500
5  600

Rename the column of the dataframe as 'points'

In [25]:
df.rename (columns = {'1': "points"}, inplace = True)

df

     0
0  100
1  200
2  300
3  400
4  500
5  600

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [51]:
#Create fruits array

fruits =['orange','mango','apple']

In [28]:
#Create series fruits out of fruits array

fruits = ['orange','mango','apple']
ser = pd.Series(list(fruits))

Change the index of fruits to the index of dataframe df

In [32]:
fruits = df.DataFrame({'fruits':['orange','mango','apple']})

AttributeError: 'DataFrame' object has no attribute 'DataFrame'

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [34]:
df = fruits

In [36]:
df.head()

TypeError: 'list' object is not callable

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [43]:
d1 = pd.DataFrame({'city':['chandigarh','Delhi','Kanpur','Chennai','Manali'],'Temprature':[15,22,20,26,-2]})

Print(d1)

In [44]:
print (d1)

         city  Temprature
0  chandigarh          15
1       Delhi          22
2      Kanpur          20
3     Chennai          26
4      Manali          -2

What is the shape of d1.

In [45]:
d1.shape

(5, 2)

Set city = d1['city']

In [46]:
city = d1['city']

print city <br>
What is the type of city.

In [47]:
print (city)

type(city)

0    chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

pandas.core.series.Series

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [48]:
d2 = pd.DataFrame({'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],'temperature':[24,35,36,39]})

print the shape of this dataframe

In [49]:

d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [52]:
d3 = pd.concat([d1,d2],axis = 0)


d3

          city  Temprature  temperature
0   chandigarh        15.0          NaN
1        Delhi        22.0          NaN
2       Kanpur        20.0          NaN
3      Chennai        26.0          NaN
4       Manali        -2.0          NaN
0    Bengalaru         NaN         24.0
1   Coimbatore         NaN         35.0
2    Srirangam         NaN         36.0
3  Pondicherry         NaN         39.0

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [58]:
#d3 [['city','temperature']]

d3 ['temperature'] <= 20#[['temperature']]

0    False
1    False
2    False
3    False
4    False
0    False
1    False
2    False
3    False
Name: temperature, dtype: bool

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [59]:

d3 ['temperature'] >= 35

0    False
1    False
2    False
3    False
4    False
0    False
1     True
2     True
3     True
Name: temperature, dtype: bool

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [66]:
# write function here

def is_ut(city):
    ut_list = []
    for a in city:
        print (a)
        if a not in ['Chandigarh','Pondichery','Delhi']:
            ut_list.append(False)
        else:
            utlist.append(True)
        return ut_list

    ut = is_ut(d3['city'])

print (d3)

          city  Temprature  temperature
0   chandigarh        15.0          NaN
1        Delhi        22.0          NaN
2       Kanpur        20.0          NaN
3      Chennai        26.0          NaN
4       Manali        -2.0          NaN
0    Bengalaru         NaN         24.0
1   Coimbatore         NaN         35.0
2    Srirangam         NaN         36.0
3  Pondicherry         NaN         39.0

In [73]:
# print d3
def is_ut(city):
    ut_list = []
    for a in d3['city']:
        print (a)
        if a not in ['Chandigarh','Pondichery','Delhi']:
            ut_list.append(False)
        else:
            utlist.append(True)
        d3['is_ut'] = ut_list

print (d3)

          city  Temprature  temperature
0   chandigarh        15.0          NaN
1        Delhi        22.0          NaN
2       Kanpur        20.0          NaN
3      Chennai        26.0          NaN
4       Manali        -2.0          NaN
0    Bengalaru         NaN         24.0
1   Coimbatore         NaN         35.0
2    Srirangam         NaN         36.0
3  Pondicherry         NaN         39.0

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [76]:
# write function here

def c_to_f(c):
    f = (c * 1.8) + 32
    return f
cel = 25

fahr = c_to_f(cel)
print('%0.1f degrees celsius is equivalent to %0.1f degrees Fahrenheit' %(cel,fahr))

25.0 degrees celsius is equivalent to 77.0 degrees Fahrenheit

In [77]:
# check function c_to_f(10)


def c_to_f(c):
    f = (c * 1.8) - 32
    return f
cel = 25

fahr = c_to_f(10)
print('%0.1f degrees celsius is equivalent to %0.1f degrees Fahrenheit' %(cel,fahr))

25.0 degrees celsius is equivalent to -14.0 degrees Fahrenheit

In [79]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
fahr_list = []

def c_to_f(c):
    f = (c * 1.8) - 32
    return f

for x in d3['temperature']:
    f = c_to_f(x)
    fahr_list.append(f)
    d3['temp.farenhiet'] = fahr_list
    
    print (d3)

ValueError: Length of values (1) does not match length of index (9)

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [2]:
d1 = d3 [d3['is_ut'] = 'ut_list']

SyntaxError: cannot assign to subscript here. Maybe you meant '==' instead of '='? (2523445267.py, line 1)

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [3]:
d1 =d3[d3['temp_farenhiet']>90]

NameError: name 'd3' is not defined

Select only the first three rows of the dataframe d1.

In [87]:
d1.loc[[1,2,3]]

      city  Temprature
1    Delhi          22
2   Kanpur          20
3  Chennai          26

Select all the rows and last two columns in the dataframe.

In [88]:
d1.loc[1:4['is_ut','temp_farenhiet']]

<>:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
<>:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]
C:\Users\Admin\AppData\Local\Temp\ipykernel_11924\100548653.py:1: SyntaxWarning: 'int' object is not subscriptable; perhaps you missed a comma?
  d1.loc[1:4['is_ut','temp_farenhiet']]

TypeError: 'int' object is not subscriptable

## Groupby

In [9]:
# Create a dataframe using dictionary of your choice
import pandas as pd

data = pd.DataFrame({
    'Name' : ['Ankit','Aishwarya','Kajal','Shubham'],
    'Age' : [23,21,29,21],
    'university' : ['BHU','JHU','DU','BHU'],
})

In [13]:
# Use Groupby of single column with aggregate sum()

df = pd.DataFrame(data, columns= ['Age']).sum()


print (df)

Age    94
dtype: int64

In [15]:
# Use Groupby of single column with aggregate count()
df2 = data.groupby (['university'])['university'].count()


print (df2)

university
BHU    2
DU     1
JHU    1
Name: university, dtype: int64

In [19]:
# Use Groupby of single column with aggregate min() and max()

df2 = data.groupby (['Age']).size().groupby(level=0).max()

print (df2)

df3 = data.groupby (['university']).size().groupby(level=0).min()

print (df3)

Age
21    2
23    1
29    1
dtype: int64
university
BHU    2
DU     1
JHU    1
dtype: int64

In [21]:
# Use Groupby of any 2 columns with aggregate mean()

df2 = data.groupby(['Age']).agg({'Age' : ['mean']})
df2.columns = ['agr_mean']

print (df2)

     agr_mean
Age
21       21.0
23       23.0
29       29.0

In [25]:
# Use Groupby of any 2 columns with aggregate min() and max()

df2 = data.groupby(['Age','Name']).agg({'Age' : ['min','max']},{'Name' : ['min','max']})
df2.columns = ['age_min' ,'age_max']

df3 = data.groupby(['university','Age']).agg({'university' : ['min','max']},{'Age' : ['min','max']})
df3.columns = ['uni_min' ,'uni_max']

print (df3)

               uni_min uni_max
university Age
BHU        21      BHU     BHU
           23      BHU     BHU
DU         29       DU      DU
JHU        21      JHU     JHU

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [36]:
import pandas as pd

a = pd.date_range (start = '2020-01-01', end = '2021-04-01')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

print a

In [37]:

print (a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [38]:

len(a)

457

What is the type of a?

In [39]:

type(a)

pandas.core.indexes.datetimes.DatetimeIndex